## S/MIME error strings.
## Note to localization: %S is a placeholder
NoSenderSigningCert=Vous avez demand\u00e9 la signature num\u00e9rique de ce message, mais l'application n'a pas trouv\u00e9 le certificat sp\u00e9cifi\u00e9 dans les pr\u00e9f\u00e9rences, ou alors le certificat a expir\u00e9.
NoSenderEncryptionCert=Vous avez demand\u00e9 le chiffrement de ce message, mais l'application n'a pas trouv\u00e9 le certificat sp\u00e9cifi\u00e9 dans les pr\u00e9f\u00e9rences, ou alors le certificat a expir\u00e9.
MissingRecipientEncryptionCert=Vous avez demand\u00e9 le chiffrement de ce message, mais l'application n'a pas trouv\u00e9 de certificat de chiffrement pour %S.
SignNoSenderEncryptionCert=Vous avez demand\u00e9 la signature de ce message, mais l'application n'a pas trouv\u00e9 de certificat de chiffrement \u00e0 inclure dans le message sign\u00e9, ou alors le certificat a expir\u00e9.
ErrorCanNotEncrypt=Impossible de chiffrer le message. Veuillez v\u00e9rifier que vous avez un certificat de courrier valide pour chaque destinataire. Veuillez v\u00e9rifier la validit\u00e9 et la confiance accord\u00e9e aux certificats sp\u00e9cifi\u00e9s dans les param\u00e8tres des comptes.
ErrorCanNotSign=Impossible de signer le message. Veuillez v\u00e9rifier la validit\u00e9 et la confiance accord\u00e9es aux certificats sp\u00e9cifi\u00e9s dans les param\u00e8tres de ce compte.

## Strings used for in the prefs.
prefPanel-smime=S\u00e9curit\u00e9
NoSigningCert=Le gestionnaire de certificats ne trouve pas de certificat valide qui puisse \u00eatre utilis\u00e9 pour signer num\u00e9riquement vos messages.
NoEncryptionCert=Le gestionnaire de certificats ne trouve pas de certificat valide que d'autres personnes pourraient utiliser pour vous envoyer du courrier chiffr\u00e9.

encryption_needCertWantSame=Vous devriez aussi sp\u00e9cifier un certificat que d'autres personnes peuvent utiliser pour vous envoyer du courrier chiffr\u00e9. Voulez-vous utiliser le m\u00eame certificat pour chiffrer et d\u00e9chiffrer les messages qui vous sont envoy\u00e9s\u00a0?
encryption_wantSame=Voulez-vous utiliser le m\u00eame certificat pour chiffrer et d\u00e9chiffrer les messages qui vous sont envoy\u00e9s\u00a0?
encryption_needCertWantToSelect=Vous devriez aussi sp\u00e9cifier un certificat que d'autres personnes peuvent utiliser pour vous envoyer du courrier chiffr\u00e9. Voulez-vous configurer un certificat de chiffrement maintenant\u00a0?
signing_needCertWantSame=Vous devriez \u00e9galement sp\u00e9cifier un certificat \u00e0 utiliser pour signer num\u00e9riquement vos messages. Voulez-vous utiliser le m\u00eame certificat pour signer num\u00e9riquement vos messages\u00a0?
signing_wantSame=Voulez-vous utiliser le m\u00eame certificat pour signer num\u00e9riquement vos messages\u00a0?
signing_needCertWantToSelect=Vous devriez \u00e9galement sp\u00e9cifier un certificat \u00e0 utiliser pour signer num\u00e9riquement vos messages. Voulez-vous configurer un certificat de signature num\u00e9rique de messages maintenant\u00a0?
