# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=L'URL n'est pas valide et ne peut \u00eatre charg\u00e9e.
fileNotFound=Firefox ne peut trouver le fichier \u00e0 l'adresse %S.
dnsNotFound=Firefox ne peut trouver le serveur \u00e0 l'adresse %S.
protocolNotFound=Firefox ne sait pas ouvrir cette adresse car le protocole (%S) n'est associ\u00e9 \u00e0 aucun programme.
connectionFailure=Firefox ne peut \u00e9tablir de connexion avec le serveur \u00e0 l'adresse %S.
netInterrupt=La connexion avec %S a \u00e9t\u00e9 interrompue pendant le chargement de la page.
netTimeout=Le serveur \u00e0 l'adresse %S met trop de temps \u00e0 r\u00e9pondre.
redirectLoop=Firefox a d\u00e9tect\u00e9 que le serveur redirige la demande pour cette adresse d'une mani\u00e8re qui n'aboutira pas.
repost=La page que vous tentez de voir contient des donn\u00e9es envoy\u00e9es par POST qui ne sont plus dans le cache. Si vous renvoyez les donn\u00e9es, toute action entreprise par la page Web (telle qu'une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Pour envoyer \u00e0 nouveau les donn\u00e9es, cliquez sur OK, sinon cliquez sur Annuler.
repostConfirm=La page que vous tentez de voir contient des donn\u00e9es envoy\u00e9es par POST. Si vous renvoyez les donn\u00e9es, toute action entreprise par la page Web (telle qu'une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Pour envoyer \u00e0 nouveau les donn\u00e9es, cliquez sur OK, sinon cliquez sur Annuler.
unknownSocketType=Firefox ne sait pas comment entrer en contact avec le serveur.
netReset=La connexion avec le serveur a \u00e9t\u00e9 r\u00e9initialis\u00e9e pendant le chargement de la page.
netOffline=Firefox est actuellement en mode hors ligne et ne peut acc\u00e9der au Web.
isprinting=Le document ne peut pas \u00eatre modifi\u00e9 pendant l'impression ou la pr\u00e9visualisation.
deniedPortAccess=Cette adresse utilise un port r\u00e9seau inhabituel pour la navigation Web. Par mesure de s\u00e9curit\u00e9, Firefox a abandonn\u00e9 la requ\u00eate.
proxyResolveFailure=Firefox est configur\u00e9 pour utiliser un serveur proxy mais celui-ci est introuvable.
proxyConnectFailure=Firefox est configur\u00e9 pour utiliser un serveur proxy mais celui-ci n'accepte pas les connexions.
externalProtocolTitle=Requ\u00eate de protocole externe
externalProtocolPrompt=Une application externe doit \u00eatre lanc\u00e9e pour g\u00e9rer les liens de type %1$S:.\n\n\nLien demand\u00e9\u00a0:\n\n%2$S\n\nApplication\u00a0: %3$S\n\n\nSi vous n'attendiez pas cette requ\u00eate, il peut s'agir d'une tentative d'exploitation de vuln\u00e9rabilit\u00e9 dans cette application. Il est conseill\u00e9 d'annuler cette requ\u00eate sauf si vous avez la certitude qu'elle n'est pas malveillante.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Application inconnue>
externalProtocolChkMsg=Se souvenir de ce choix pour tous les liens de ce type.
externalProtocolLaunchBtn=Lancer l'application
