# ***** BEGIN LICENSE BLOCK *****
# Version: MPL 1.1/GPL 2.0/LGPL 2.1
#
# The contents of this file are subject to the Mozilla Public License Version
# 1.1 (the "License"); you may not use this file except in compliance with
# the License. You may obtain a copy of the License at
# http://www.mozilla.org/MPL/
#
# Software distributed under the License is distributed on an "AS IS" basis,
# WITHOUT WARRANTY OF ANY KIND, either express or implied. See the License
# for the specific language governing rights and limitations under the
# License.
#
# The Original Code is mozilla.org code.
#
# The Initial Developer of the Original Code is
# Netscape Communications Corporation.
# Portions created by the Initial Developer are Copyright (C) 1998
# the Initial Developer. All Rights Reserved.
#
# Contributor(s):
#
# Alternatively, the contents of this file may be used under the terms of
# either of the GNU General Public License Version 2 or later (the "GPL"),
# or the GNU Lesser General Public License Version 2.1 or later (the "LGPL"),
# in which case the provisions of the GPL or the LGPL are applicable instead
# of those above. If you wish to allow use of your version of this file only
# under the terms of either the GPL or the LGPL, and not to allow others to
# use your version of this file under the terms of the MPL, indicate your
# decision by deleting the provisions above and replace them with the notice
# and other provisions required by the GPL or the LGPL. If you do not delete
# the provisions above, a recipient may use your version of this file under
# the terms of any one of the MPL, the GPL or the LGPL.
#
# ***** END LICENSE BLOCK *****

malformedURI=L'URL n'est pas valide et ne peut \u00eatre charg\u00e9e.
fileNotFound=Impossible de trouver le fichier %S. V\u00e9rifiez son emplacement et essayez \u00e0 nouveau.
dnsNotFound=%S est introuvable. Veuillez v\u00e9rifier le nom et essayer \u00e0 nouveau.
protocolNotFound=%S n'est pas un protocole reconnu.
connectionFailure=Connexion refus\u00e9e lors de la tentative de contact de %S.
netInterrupt=La connexion \u00e0 %S a \u00e9t\u00e9 coup\u00e9e brusquement. Des donn\u00e9es peuvent avoir \u00e9t\u00e9 transmises.
netTimeout=D\u00e9lai de connexion d\u00e9pass\u00e9 lors du contact de %S.
redirectLoop=La limite de redirection de cette URL a \u00e9t\u00e9 d\u00e9pass\u00e9e. Chargement interrompu.  Cette interruption peut \u00eatre due \u00e0 un cookie bloqu\u00e9.
repost=La page que vous tentez de voir contient des donn\u00e9es POSTDATA qui ne sont plus dans le cache. Si vous renvoyez les donn\u00e9es, toute action entreprise par la page Web (telle qu'une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Pour envoyer \u00e0 nouveau les donn\u00e9es, cliquez sur OK, sinon cliquez sur Annuler.
repostConfirm=La page que vous tentez de voir contient des donn\u00e9es POSTDATA. Si vous renvoyez les donn\u00e9es, toute action entreprise par la page Web (telle qu'une recherche ou un achat en ligne) sera r\u00e9p\u00e9t\u00e9e. Pour envoyer \u00e0 nouveau les donn\u00e9es, cliquez sur OK, sinon cliquez sur Annuler.
unknownSocketType=Socket de type inconnu. Chargement interrompu.
netReset=Le document ne contient aucune donn\u00e9e.
netOffline=Ce document ne peut pas \u00eatre affich\u00e9 en \u00e9tant hors ligne. Pour vous connecter, d\u00e9cochez Travailler hors connexion \u00e0 partir du menu Fichier.
isprinting=Le document ne peut pas \u00eatre modifi\u00e9 pendant l'impression ou la pr\u00e9visualisation.
deniedPortAccess=L'acc\u00e8s au port sp\u00e9cifi\u00e9 a \u00e9t\u00e9 d\u00e9sactiv\u00e9 pour des raisons de s\u00e9curit\u00e9.
proxyResolveFailure=Le serveur proxy que vous avez configur\u00e9 est introuvable. Veuillez v\u00e9rifier les param\u00e8tres et r\u00e9essayer.
proxyConnectFailure=La connexion a \u00e9t\u00e9 refus\u00e9e au contact du serveur proxy que vous avez configur\u00e9. Veuillez v\u00e9rifier les param\u00e8tres et r\u00e9essayer.
externalProtocolTitle=Requ\u00eate de protocole externe
externalProtocolPrompt=Une application externe doit \u00eatre lanc\u00e9e pour g\u00e9rer les liens de type %1$S:.\n\n\nLien requis\u00a0:\n\n%2$S\n\nProgramme\u00a0: %3$S\n\n\nSi vous n'attendiez pas cette requ\u00eate, il peut s'agir d'une tentative d'exploiter une faiblesse dans cet autre programme. Il vous est conseill\u00e9 d'annuler cette requ\u00eate si vous n'avez pas la certitude qu'elle n'est pas malveillante.\n
#LOCALIZATION NOTE (externalProtocolUnknown): The following string is shown if the application name can't be determined
externalProtocolUnknown=<Application inconnue>
externalProtocolChkMsg=Se souvenir de mon choix pour tous les liens de ce type.
externalProtocolLaunchBtn=Lancer l'application
